Revit 2027 API
ParameterTypeId.RebarShapeParamStartHookTanLen Property
 "Start Tangent Hook Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeParamStartHookTanLen { get; }
Public Shared ReadOnly Property RebarShapeParamStartHookTanLen As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeParamStartHookTanLen {
	ForgeTypeId^ get ();
}
static member RebarShapeParamStartHookTanLen : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace